In [3]:
import numpy as np
import pandas as pd
%matplotlib inline

In [4]:
#*****************Pandas Series******************

In [5]:
labels=['a','b','c']
my_list=[10,20,30]
arr= np.array([10,20,30])
d={'a':10,'b':20,'c':100}

In [6]:
#1.create a pandas Series

#pass in list
pd.Series(my_list,index=labels)
#pass in arr
#pass in dict

#1.1 Series can even store built-in functions
#this is amazing !!
pd.Series([sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [7]:
ser1=pd.Series([1,2,3,4],index=['USA','CHINA','FRANCE','GERMANY'])
ser1
ser1['USA']

1

In [8]:
ser2=pd.Series([1,2,3,4],index=['USA','CHINA','ITALY','JAPAN'])

In [9]:
#add two series, if there is a match, there is a match; if not there will be a NaN value
ser1+ser2

CHINA      4.0
FRANCE     NaN
GERMANY    NaN
ITALY      NaN
JAPAN      NaN
USA        2.0
dtype: float64

In [10]:
#*****************Pandas DataFrame Part 1******************
from numpy.random import randn
np.random.seed(101)

In [11]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #here we don't need index=, we just directly type in index
#randn() means 5 rows and 4 colums
df

#1. get a colum
#DataFrame is a bunch of Series which share the same index 
df['W']
#if we want a single colum, we get a Series

df[['W','Z']]
# if we want multiple columns, we get a DataFrame

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [12]:
#2. add/move a new column

df['new'] = df['W']+df['Z']
a=df.drop('new',axis=1)
print(a)
b=df.drop('E')
print(b)
#Pay attention here: drop means drop a row, so if we want to drop a column, we need to specify axis =1 

#aslo, as mentioned before,if we want to directly modify the original df, we need to specify: inplace=True

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [13]:
df.shape
#here is interesting. why axis = 0 represents row, and axis=1 represents column?
#it's because of the shape. shape is tuple, tuple(0) is row, tuple(1) is colum

(5, 5)

In [14]:
#3 .select rows: 2 methods
#3.1 loc[], only for labels

df.loc['A']
#if we want a single row, it will also returns a Series 

#3.2 iloc[], use both index and labels 
df.iloc[2]

#3.3 get two rows
#df.loc['A','B']

#3.4 more detailed
df.loc[['A','B'],['W','Y']]

df.loc['B','Y']

-0.8480769834036315

In [15]:
#****************************Pandas DataFrame Part 2*********************

In [16]:
#1. conditional selection
#就像excel中根据一些条件来选取数据
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

In [17]:
booldf = df>0
print(booldf)

#pass boodf to df，这里不是很懂啊
df[booldf]

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118       NaN       NaN  0.605965  1.257083
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [18]:
#conditional selection for a column
df['W']>0
boolcolumn = df['W']>0
df['W'][boolcolumn]

df[boolcolumn]
#only return the results where conditions to be true
df[boolcolumn][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [19]:
# the conditional selection is very useful, very simple

In [20]:
#2. multiple condition 
df[df['W']>0 and df['Y']>1]  #  用逻辑词连接

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
#有的时候我会得到报错说我的真值是 ambiguous，
#因为在python中只有 True and False这种简单的boolean value才能获得真值，如果是一个Series的比较的话就计算机不能识别

In [23]:
#pandas中的multiple condition只能用 &
df[(df['W']>0) &( df['Y']>1) ] 

#and in pandas we use | to represent or 
df[(df['W']>0)  | ( df['Y']>1) ]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [26]:
#3. reset index
df.reset_index() # default by resetting  it as 1,2,3,4, but this create a new obj, so the original df's index is still A,B,C,D, we just need to adjust inplace = True
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [29]:
newind = 'CA NY WY OR CO'.split() #a nice, quick way to create a list (learn to use split() )
print(newind)
df['States'] = newind
df

['CA', 'NY', 'WY', 'OR', 'CO']

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  3.210676     CA
B  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
C -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
D  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR
E  0.190794  1.978757  2.605967  0.683509  0.874303     CO

In [30]:
#3.1 set_index() VS reset_index()
#if you already have a column in your DF, and you want to make it the index, just use set_index instead of reset_index()
df.set_index('States')

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  3.210676
NY      0.651118 -0.319318 -0.848077  0.605965  1.257083
WY     -2.018168  0.740122  0.528813 -0.589001 -2.607169
OR      0.188695 -0.758872 -0.933237  0.955057  1.143752
CO      0.190794  1.978757  2.605967  0.683509  0.874303

In [ ]:
#****************************Pandas DataFrame Part 3*********************

In [34]:
#1. create a MultiIndex DataFrame
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #zip connects data into pairs
hier_index = pd.MultiIndex.from_tuples(hier_index) # this makes your index into MultiIndex
df2= pd.DataFrame(randn(6,2), hier_index, ['A','B'])
print(df2)

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [37]:
#2. get value from a MultiIndex DataFrame
df2.loc['G1']
df2.loc['G1'].loc[1] #call from outside, then go inside

A    1.025984
B   -0.156598
Name: 1, dtype: float64

In [44]:
df2.index.names = ['Groups','Num'] #the outside index name is 'Groups', and the inside index name is 'Num'
df2.xs('G1')  # except for loc(),we can also use xs()
df2.xs(1,level = 'Num') #also, we can use it by passing the name of the index

               A         B
Groups
G1      1.025984 -0.156598
G2     -0.755325 -0.346419

In [ ]:
#*****************Pandas Missing Data******************

In [ ]:
#*****************Pandas Groupby******************

In [18]:
import numpy as np
import pandas as pd
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
print(df)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [19]:
bycom = df.groupby('Company')
print(bycom)
bycom.mean() #after groupby, you can calculate the mean of the group data
bycom.sum()
bycom.sum().loc['FB']
df.groupby('Company').count()

#finally you can also use describe() method
df.groupby('Company').describe()

df.groupby('Company').describe().transpose() #transpose means 转置
df.groupby('Company').describe().transpose()['FB'] #retrive the data of FB after transpose

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x7faa0919e2b0>

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [20]:
#*****************Pandas Merging Joining and Concatenating******************

In [21]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                    index = [0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                    index = [4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},
                    index = [8,9,10,11])

In [22]:
#1.concatenation 
#to concatenate different dataframes by rows(就是竖着连接的)
pd.concat([df1,df2,df3])
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [36]:
import pandas as pd
#2. merging
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                      'C':['C8','C9','C10','C11'],
                      'D':['D8','D9','D10','D11']})
pd.merge(left,right,how='inner',on='key') 
#default by inner, here both left and right has the column of 'key', so we can merge this column
#how 的方法有inner, outer, left, right
#inner 保留两个表的公共部分
#outer 保留两个表的所有内容
#left 只保留左表的内容
#right 只保留右表的内容

  key   A   B    C    D
0  K0  A0  B0   C8   D8
1  K1  A1  B1   C9   D9
2  K2  A2  B2  C10  D10
3  K3  A3  B3  C11  D11

In [41]:
#we can pass a list of keys
left = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K0','K1'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key1':['K0','K1','K1','K3'],
                      'key2':['K0','K0','K0','K0'],
                      'C':['C0','C1','C2','C3'],
                      'D':['D0','D1','D2','D3']})

pd.merge(left,right,on=['key1','key2'])  #only the first row has the same

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0

In [39]:
#3. joining
left = pd.DataFrame({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2']},
                   index=['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C2','C3'],
                      'D':['D0','D2','D3']},
                    index=['K0','K2','K3'])
left.join(right) #default by left index
left.join(right,how='outer') #'outer' to keep idnexs of left and right

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
#*****************Pandas Operations******************

In [45]:
#1.unique()
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()
#if you want to know how many uniques we have, there are two methods
df['col2'].unique()
#len(df.)
len(df['col2'].unique())
#pandas built-in method
df['col2'].nunique()

3

In [47]:
#2. value_counts(): how many times the value has appeared
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [52]:
#3. apply()
def times2(x):
    return x*2
df['col1'].apply(times2) #将col1的数据全部乘以2

#also
df['col3'].apply(len)  #return the len() of strings

#lambda
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [ ]:
#4. remove columns
df.drop('col1',axis=1)